app/controllers/api/user_feeds_controller.rb

  def create
    @userfeed = UserFeed.new(user_feed_params)
    if @userfeed.save
---
INSERT INTO "user_feeds" ("created_at", "feed_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 03 Apr 2015 01:03:30 UTC +00:00], ["feed_id", 6], ["updated_at", Fri, 03 Apr 2015 01:03:30 UTC +00:00], ["user_id", 1]]